const nums = [1, 2, 3, 4, 5]
//   累進    每回合
// ----------------
//    0   |   1
// ----------------
// ----------------
//    1   |   2
// ----------------
// ----------------
//    3   |   3
// ----------------
// ----------------
//    6   |   4
// ----------------
// ----------------
//    10   |   5
// ----------------
//    15
// ......
// 
//                              (累進, 每回合)
const result = nums.reduce(function(x, y) {
    return x + y
}, 0) // 0 這邊是初始累進值，預設雖然是無，但是沒給初始值流程完全不同
// 沒有給予初始值會直接拿初始結果，然後少跑一圈

console.log(result)

// 每一回合的回傳值會變成下一回合的累進值
// 類似1加到100 = 505